# DefaultOpenFromCloudCallback Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefaultOpenFromCloudCallback Properties
DefaultOpenFromCloudCallback Class See Also
---
The DefaultOpenFromCloudCallback type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace